# Pandas

# file Read Write operation

In [1]:
import numpy as np
import pandas as pd
np.set_printoptions(precision=4) # it will limit the data in 4 position

## data can be stored  in Pandas


- in  Series
- in Dataframe

In [2]:
import pandas as pd

draft1 = pd.read_csv('/Users/rrashmi/3.My_projects/DataScience/pandas_1/ex1.csv', header=None)    # Supply the file name (path)
draft1.head() # it considers first row as header a b c d is a dataset but not a header
# use, header=NOne to remove header

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [3]:
draft2 = pd.read_table('/Users/rrashmi/3.My_projects/DataScience/pandas_1/test.tsv', sep='\t')  # Read a tsv into a DataFrame

draft2.head()

        test   test test.1 test.2 test.3
sudh    sudh   sudh   sudh   sudh   sudh
kumar  kumar  kumar  kumar  kumar  kumar

In [4]:
df = pd.read_csv('/Users/rrashmi/3.My_projects/DataScience/pandas_1/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
pd.read_table('/Users/rrashmi/3.My_projects/DataScience/pandas_1/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
pd.read_csv('/Users/rrashmi/3.My_projects/DataScience/pandas_1/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [7]:
df =pd.read_csv('/Users/rrashmi/3.My_projects/DataScience/pandas_1/ex2.csv', names=['asdfdsfs','fsdf', 'b', 'c', 'sudh', 'message'] ) # take column names
df.head()

   asdfdsfs  fsdf   b   c   sudh  message
0         1     2   3   4  hello      NaN
1         5     6   7   8  world      NaN
2         9    10  11  12    foo      NaN

In [8]:
!cat /Users/rrashmi/3.My_projects/DataScience/pandas_1/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [15]:

parsed = pd.read_csv('/Users/rrashmi/3.My_projects/DataScience/pandas_1/csv_mindex.csv',index_col=['key1', 'key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [16]:
!cat /Users/rrashmi/3.My_projects/DataScience/pandas_1/ex4.csv
pd1=pd.read_csv('/Users/rrashmi/3.My_projects/DataScience/pandas_1/ex4.csv', skiprows=[0, 2, 3],header=None)
pd1

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [17]:
!cat /Users/rrashmi/3.My_projects/DataScience/pandas_1/ex5.csv
result = pd.read_csv('/Users/rrashmi/3.My_projects/DataScience/pandas_1/ex5.csv',header=None)
result
pd.isnull(result) # where there is a no dataset, it gives True

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

       0      1      2      3      4      5
0  False  False  False  False  False  False
1  False  False  False  False  False   True
2  False  False  False   True  False  False
3  False  False  False  False  False  False

In [18]:
result = pd.read_csv('/Users/rrashmi/3.My_projects/DataScience/pandas_1/ex5.csv', na_values=['NULL'])
# NULL--> put null value if there is novalue inside the table with" NaN"
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [19]:
df=pd.read_excel('/Users/rrashmi/3.My_projects/DataScience/pandas_1/ex1.xlsx')
df

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [28]:
#draft3 = pd.read_excel('/Users/rrashmi/3.My_projects/DataScience/pandas_1/Transactions_Zenapt.xlsx',sheetname = 'Expense') # Name of sheet to read from

#draft3.head(6)

In [29]:
url = "http://www.basketball-reference.com/leagues/NBA_2015_totals.html"

BB_data = pd.read_html(url)         # Read data from the specified url

BB_data[0].ix[:, 0:10].head(5)      # Check 5 rows (10 columns only)

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:5: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """

  Rk         Player Pos Age   Tm   G  GS    MP   FG  FGA
0  1     Quincy Acy  PF  24  NYK  68  22  1287  152  331
1  2   Jordan Adams  SG  20  MEM  30   0   248   35   86
2  3   Steven Adams   C  21  OKC  70  67  1771  217  399
3  4    Jeff Adrien  PF  28  MIN  17   0   215   19   44
4  5  Arron Afflalo  SG  29  TOT  78  72  2502  375  884

In [30]:
titanic_train = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",
                           sep='\t')

In [31]:
titanic_train.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [32]:
titanic_train[["Name","Pclass"]].head()

                                                Name  Pclass
0                            Braund, Mr. Owen Harris       3
1  Cumings, Mrs. John Bradley (Florence Briggs Th...       1
2                             Heikkinen, Miss. Laina       3
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)       1
4                           Allen, Mr. William Henry       3

In [33]:
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [34]:
pd.options.display.max_rows = 10

In [35]:
result = pd.read_csv('/Users/rrashmi/3.My_projects/DataScience/pandas_1/ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [41]:
pd.read_csv('/Users/rrashmi/3.My_projects/DataScience/pandas_1/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [42]:
chunk = pd.read_csv('/Users/rrashmi/3.My_projects/DataScience/pandas_1/ex6.csv', chunksize=1000)
chunk

Writing Data to Text Format

In [43]:
data = pd.read_csv('/Users/rrashmi/3.My_projects/DataScience/pandas_1/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [44]:
data.to_csv('/Users/rrashmi/3.My_projects/DataScience/pandas_1/out.csv')
!cat /Users/rrashmi/3.My_projects/DataScience/pandas_1/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [45]:
import sys
data.to_csv('/Users/rrashmi/3.My_projects/DataScience/pandas_1/out1.csv', sep='@')

In [46]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [47]:
data.to_csv('/Users/rrashmi/3.My_projects/DataScience/pandas_1/out2.csv', index=False, header=False)

In [48]:
data.to_csv('/Users/rrashmi/3.My_projects/DataScience/pandas_1/out3.csv', index=False, columns=['a', 'b', 'c'])

In [50]:
dates = pd.date_range('1/1/2000', periods=7)
ts = pd.Series(np.arange(7), index=dates)
ts.to_csv('/Users/rrashmi/3.My_projects/DataScience/pandas_1/tseries.csv')
!cat /Users/rrashmi/3.My_projects/DataScience/pandas_1/series.csv

cat: /Users/rrashmi/3.My_projects/DataScience/pandas_1/series.csv: No such file or directory

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:3: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  This is separate from the ipykernel package so we can avoid doing imports until

Working with Delimited Formats

In [52]:
import csv
f = open('/Users/rrashmi/3.My_projects/DataScience/pandas_1/ex7.csv')

reader = csv.reader(f)
reader

In [53]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [56]:
with open('/Users/rrashmi/3.My_projects/DataScience/pandas_1/ex7.csv') as f:
    lines = list(csv.reader(f))
lines

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [57]:
header, values = lines[0], lines[1:]

In [58]:
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

JSON Data

In [59]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [60]:
import json
result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [ ]:
asjson = json.dumps(result)

In [ ]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age','pets'])
siblings

In [ ]:
!cat /Users/sudhanshukumar/Downloads/examples/example.json

In [ ]:
data = pd.read_json('/Users/sudhanshukumar/Downloads/examples/example.json')
data

In [ ]:
print(data.to_json())
print(data.to_json(orient='records'))

XML and HTML: Web Scraping

In [ ]:
tables = pd.read_html('/Users/sudhanshukumar/Downloads/examples/fdic_failed_bank_list.html')
len(tables)
failures = tables[0]
failures.head()

In [ ]:
close_timestamps = pd.to_datetime(failures['Closing Date'])
close_timestamps.dt.year.value_counts()
#close_timestamps

# Binary Data Formats

In [ ]:
frame = pd.read_csv('/Users/sudhanshukumar/Downloads/examples/ex1.csv')
frame
frame.to_pickle('/Users/sudhanshukumar/Downloads/examples/frame_pickle')

In [ ]:
pd.read_pickle('/Users/sudhanshukumar/Downloads/examples/frame_pickle')

In [ ]:
!rm /Users/sudhanshukumar/Downloads/examples/frame_pickle

Using HDF5 Format

In [ ]:
frame = pd.DataFrame({'a': np.random.randn(100)})
store = pd.HDFStore('mydata.h5')
store['obj1'] = frame
store['obj1_col'] = frame['a']
store

In [ ]:
store['obj1']

In [ ]:
store.put('obj2', frame, format='table')
store.select('obj2', where=['index >= 10 and index <= 15'])
store.close()

In [ ]:
frame.to_hdf('mydata.h5', 'obj3', format='table')
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

# Web APIs

In [ ]:
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp

In [ ]:
data = resp.json()
data[2]['user']

In [ ]:
issues = pd.DataFrame(data, columns=['number', 'title',
                                     'labels', 'state'])
issues

# Interacting with Databases

In [ ]:
import sqlite3
#connecting with the database.
db = sqlite3.connect("my_database4.db")
# Drop table if it already exist using execute() method.
db.execute("drop table if exists test")
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""
con = sqlite3.connect('mydata2.sqlite')
con.execute(query)
con.commit()

In [ ]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

In [ ]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

In [ ]:
cursor.description
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

In [ ]:
#!/usr/bin/python

import sqlite3
#connecting with the database.
db = sqlite3.connect("my_database5.db")
# Drop table if it already exist using execute() method.
db.execute("drop table if exists grades1")
# Create table as per requirement
db.execute("create table grades1(id int, name text, score int)")
#inserting values inside the created table
db.execute("insert into grades1(id, name, score) values(101, 'John',99 )")
db.execute("insert into grades1(id, name, score) values(102, 'Gary',90 )")
db.execute("insert into grades1(id, name, score) values(103, 'James', 80 )")
db.execute("insert into grades1(id, name, score) values(104, 'Cathy', 85 )")
db.execute("insert into grades1(id, name, score) values(105, 'Kris',95 )")

In [ ]:
db.commit()

In [ ]:
results = db.execute("select * from grades1 order by id")
for row in results:
    print((row))
print("-" * 60 )

In [ ]:
results = db.execute("select * from grades1 where name = 'Gary' ")
for row in results: print(row)
print("-"* 60 )

In [ ]:
results = db.execute("select * from grades1 where score >= 90 ")
for row in results:
    print(row)
print("-" * 60 )

In [ ]:
results = db.execute("select name, score from grades1 order by score desc ")
for row in results:
    print(row)
print("-" * 60 )

In [ ]:
results = db.execute("select name, score from grades1 order by score")
for row in results:
    print(row)
print("-" * 60 )

In [ ]:
results = db.execute("select name, score from grades1 order by score")
for row in results:
    print(row)